Конфигурация/InformationRegisters/РасчетныеЦеныНРД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РасчетныеЦеныНРД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>PRICE</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RATE</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RATE_LBOUND</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RATE_UBOUND</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>VERSION</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>METHOD_NUMBER</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TYPE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/КодыВТорговыхСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыВТорговыхСистемах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
						<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКодовВТорговыхСистемах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыКодовВТорговыхСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКодовВТорговыхСистемах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КодНаММВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаRTSBoard</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодВДепозитарии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CFI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ISIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаММВБКраткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодНаRTSStandart</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/InformationRegisters/РасчетныеЦеныНРД/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = "Файлы XML (*.xml)|*.xml";

	Если Не ДиалогВыбора.Выбрать() Тогда
		Возврат;
	КонецЕсли;
		
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ДиалогВыбора.ПолноеИмяФайла);
	
	ПостроительDOM = Новый ПостроительDOM;
	
	ДокументDOM  = ПостроительDOM.Прочитать(ЧтениеXML);
	
	ВыборкаXPath = ДокументDOM.ВычислитьВыражениеXPath("//estimation/estimation_date", ДокументDOM.ЭлементДокумента, Новый РазыменовательПространствИменDOM(ДокументDOM.ЭлементДокумента));
	
	ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
	ДатаПроведенияОценки = ЭлементDOM.ТекстовоеСодержимое;
	
	ВыборкаXPath = ДокументDOM.ВычислитьВыражениеXPath("//estimation/market", ДокументDOM.ЭлементДокумента, Новый РазыменовательПространствИменDOM(ДокументDOM.ЭлементДокумента));
	
	ЗагружаемыеКолонки = Новый Массив;
	ЗагружаемыеКолонки.Добавить("isin");
	ЗагружаемыеКолонки.Добавить("price");
	ЗагружаемыеКолонки.Добавить("rate");
	
	ТаблицаДанных = Новый Массив;
	
	Пока Истина Цикл
		
		ЭлементDOM = ВыборкаXPath.ПолучитьСледующий();
		Если ЭлементDOM = Неопределено Тогда
			Прервать
		КонецЕсли;
		
		Для каждого УзелИнструмент Из ЭлементDOM.ДочерниеУзлы Цикл
			
			Колонки = Новый Структура;
			Отказ = Ложь;
			Для каждого РеквизитИнструмента Из УзелИнструмент.ДочерниеУзлы Цикл
				
				Если ЗагружаемыеКолонки.Найти(РеквизитИнструмента.ИмяУзла) = Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				
				Если РеквизитИнструмента.ИмяУзла = "type" и РеквизитИнструмента.ТекстовоеСодержимое = "otc" Тогда
					Отказ = Истина;
					Прервать;
				КонецЕсли;
				
				Колонки.Вставить(РеквизитИнструмента.ИмяУзла, РеквизитИнструмента.ТекстовоеСодержимое);
			
			КонецЦикла; 
			
			Если Не Отказ Тогда
				ТаблицаДанных.Добавить(Колонки);
			КонецЕсли; 
		
		КонецЦикла; 
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	ОбработатьТаблицуСервер(ДатаПроведенияОценки, ТаблицаДанных);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка завершена");
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьТаблицуСервер(ДатаПроведенияОценки, Данные)

	Период = Дата(СтрЗаменить(ДатаПроведенияОценки, "-", ""));
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("isin",  Метаданные.РегистрыСведений.КодыВТорговыхСистемах.Ресурсы.Код.Тип);
	ТаблицаДанных.Колонки.Добавить("price", Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦена.Тип);
	ТаблицаДанных.Колонки.Добавить("rate",  Метаданные.ОпределяемыеТипы.ЦенныеБумагиЦенаПроцент.Тип);
	
	Для каждого СтрокаДанных Из Данные Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(), СтрокаДанных);
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанных.isin,
		|	ТаблицаДанных.price,
		|	ТаблицаДанных.rate
		|ПОМЕСТИТЬ _ТаблицаДанных
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Период,
		|	КодыВТорговыхСистемахСрезПоследних.Объект КАК ЦеннаяБумага,
		|	_ТаблицаДанных.price,
		|	_ТаблицаДанных.rate
		|ИЗ
		|	_ТаблицаДанных КАК _ТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО _ТаблицаДанных.isin = КодыВТорговыхСистемахСрезПоследних.Код";
				   
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Запись = РегистрыСведений.РасчетныеЦеныНРД.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Рынок = РаботаСЦеннымиБумагамиКлиентСервер.РынокПоЦеннойБумаге(Запись.ЦеннаяБумага);
		Запись.Записать();
	
	КонецЦикла; 

КонецПроцедуры
